Revit.Elements.FamilyType
A Revit FamilyType, the Revit API refers to this as a FamilySymbol

Revit.Elements.FamilyType.InternalFamilySymbol
Internal wrapper property

Revit.Elements.FamilyType.InternalElement
Reference to the Element

Revit.Elements.FamilyType.#ctor(Autodesk.Revit.DB.FamilySymbol)
Private constructor for building a DSFamilySymbol
symbol:

Revit.Elements.FamilyType.InitFamilySymbol(Autodesk.Revit.DB.FamilySymbol)
Initialize a FamilySymbol element
symbol:

Revit.Elements.FamilyType.InternalSetFamilySymbol(Autodesk.Revit.DB.FamilySymbol)
Set the internal model of the family symbol along with its ElementId and UniqueId
symbol:

Revit.Elements.FamilyType.Name
Get the name of this Family Type

Revit.Elements.FamilyType.Family
Get the parent family of this FamilyType

Revit.Elements.FamilyType.ByFamilyAndName(Revit.Elements.Family,System.String)
Select a FamilyType given its parent Family and the FamilyType's name.
family: The FamilyTypes's parent Family
name: The name of the FamilyType
Returns:
symbol

Revit.Elements.FamilyType.ByFamilyNameAndTypeName(System.String,System.String)
Select a FamilyType give it's family name and type name.
familyName: The FamilyType's parent Family name.
typeName: The name of the FamilyType.
Returns:
symbol

Revit.Elements.FamilyType.ByName(System.String)
Select a FamilyType given it's name.  This method will return the first FamilyType it finds if there are
two or more FamilyTypes with the same name.
name: The name of the FamilyType
Returns:
symbol

Revit.Elements.FamilyType.ByGeometry(Autodesk.DesignScript.Geometry.Solid,System.String,Revit.Elements.Category,System.String,Revit.Elements.Material,System.String)
Create new Family Type from a solid geometry.
This method exports the geometry to SAT and imports it into
a new family document.
solidGeometry:
name: Name fo the Family Type
category: Family Type Category
templatePath: Family Template to use for creation
material: Material to apply to the solids
subcategory: Subcategory for the Family Type (optional)
Returns: Family Type

Revit.Elements.FamilyType.VoidByGeometry(Autodesk.DesignScript.Geometry.Solid,System.String,Revit.Elements.Category,System.String)
Create a Void Family Type from a solid geometry.
This method exports the solid to SAT and imports it into
a new family document.
solidGeometry:
name: Name to apply to the Family Type
category: Category to apply
templatePath: Template file to use for creation
Returns: Void Family Type

Revit.Elements.FamilyType.FromExisting(Autodesk.Revit.DB.FamilySymbol,System.Boolean)
Obtain a FamilyType by selection.
familyType:
isRevitOwned:
Returns: